import { NextApiRequest, NextApiResponse } from "next";

export default (req: NextApiRequest, res: NextApiResponse) => {
  res.statusCode = 200;
  res.json([
    {
      label: "จัดการเอกสาร",
      children: [
        {
          label: "อัปโหลดเอกสารใหม่",
          subLabel: "อัปโหลดเอกสารใหม่ไปยังแต่ละหัวข้อ",
          href: "#",
        },
        {
          label: "จัดการเอกสาร",
          subLabel: "จัดการ / แก้ไขเอกสารที่อัปโหลดไปแล้ว",
          href: "#",
        },
        {
          label: "ประวัติ",
          subLabel: "ประวัติการเข้าถึงเอกสาร / อัปโหลด / แก้ไข",
          href: "#",
        },
      ],
    },

    {
      label: "จัดการบัญชี",
      children: [
        {
          label: "แก้ไขข้อมูลบัญชี",
          subLabel:
            "จัดการแก้ข้อมูลทั่วไปเกี่ยวกับบัญชี เช่น เปลี่ยนชื่อ , อีเมล",
          href: "#",
        },
        {
          label: "เปลี่ยนรหัสผ่าน",
          subLabel: "เปลี่ยนรหัสผ่านของบัญชีนี้สำหรับการเข้าสู่ระบบ",
          href: "#",
        },
      ],
    },
    {
      label: "ค้นหาเอกสาร",
      href: "#",
    },
    {
      label: "จัดการระบบ",
      children: [
        {
          label: "เพิ่มปีการศึกษา",
          subLabel: "จัดการปีการศึกษาหรือปิด/เปิด ปีการศึกษาในระบบ",
          href: "#",
        },
        {
          label: "จัดการหัวข้อเอกสาร",
          subLabel:
            "จัดการเพิ่มหัวข้อเอกสาร แก้ไขหัวข้อเอกสาร หริือปิดเปิดเมนู ",
          href: "#",
        },
        {
          label: "จัดการผู้ใช้งานระบบ",
          subLabel: "จัดการสิทธิ์ของผู้ใช้งาน หรือแก้ไขข้อมูลส่วนตัวของผูัใช้",
          href: "#",
        },
        {
          label: "ตั้งค่าข้อมูลระบบ",
          subLabel:
            "ปรับเปลี่ยนเมนูการตั้งค่าของระบบเว็บทั้งหมดเช่น ชื่อระบบ / ปิดเปิดระบบ และอื่นๆ",
          href: "#",
        },
        {
          label: "ดู Log ของระบบ",
          subLabel:
            "ดูประวัติการเข้าถึงระบบทั้งหมด เช่น ประวัติการ Login / อัปโหลดเอกสาร / สถิติ",
          href: "#",
        },
      ],
    },
  ]);
};
